src/cf/InformationRegisters/ВариантыПримененияТребованийЗаконодательства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ВариантыПримененияТребованийЗаконодательства</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Условие</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьУсловие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УдалитьУсловияПримененияТребованийЗаконодательства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/НалогиОтчеты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>НалогиОтчеты</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПолученИзВнешнегоСервиса</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтключенПользователем</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НалогОтчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗадачиБухгалтера</v8:Type>
						<v8:Type>cfg:CatalogRef.ПравилаПредставленияОтчетовУплатыНалогов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Catalogs/ПравилаПредставленияОтчетовУплатыНалогов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ПравилаПредставленияОтчетовУплатыНалогов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ЗадачиБухгалтера</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НачалоДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Действие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДействийКалендаряБухгалтера</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФинансовыйПериод</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Периодичность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОграничениеПериода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>24</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокМесяцев</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокДней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПеренестиНаРабочийДень</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазовыйПериод</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтставаниеБазовогоПериода</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитДопУпорядочивания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьИнформацияНаИТС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасширенныйПервыйНалоговыйПериод</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыРасширенногоПервогоНалоговогоПериода</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправкаОтчетаОграничена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеПродленияСроковНалоговОтчетов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчитатьСрокВРабочихДнях</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсключатьПериодИзПредставленияЗадачи</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачальныйСрокМесяцев</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачальныйСрокДней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьОснованиеПродленияСроковНалоговОтчетов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОснованияПродленияСроковНалоговОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПеренестиСрокНачалаНаРабочийДень</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыполняетсяЕдинымПомощником</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсключатьИмяРодительскойЗадачиИзПредставленияЗадачи</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Условия</Name>
					<Comment>объединяются по "И"</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>УдалитьУсловие</Name>
							<Type>
								<v8:Type>cfg:EnumRef.УдалитьУсловияПримененияТребованийЗаконодательства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Условие</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОснованияПродленияСроков</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОснованиеПродленияСроковНалоговОтчетов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/InformationRegisters/ВариантыПримененияТребованийЗаконодательства/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс
	
Функция НастройкиПримененияТребований() Экспорт
	
	Настройки = Новый ТаблицаЗначений;
	Настройки.Колонки.Добавить("Наименование",    Новый ОписаниеТипов("Строка"));
	Настройки.Колонки.Добавить("Задача",          Новый ОписаниеТипов("СправочникСсылка.ЗадачиБухгалтера"));
	Настройки.Колонки.Добавить("Варианты",        Новый ОписаниеТипов(Справочники.ПравилаПредставленияОтчетовУплатыНалогов.ОписаниеТипаУсловияПримененияТребованияЗаконодательства(), "ТаблицаЗначений"));
	Настройки.Колонки.Добавить("ЗаголовокВыбора", Новый ОписаниеТипов("Строка")); // Заголовок переключателя в форме выбора
	Настройки.Колонки.Добавить("ВыбиратьВСписке", Новый ОписаниеТипов("Булево"));
	Настройки.Индексы.Добавить("Задача");
	
	// Дополнительные страховые взносы сотрудников
	Настройка = ДобавитьНастройку(
		Настройки,
		НСтр("ru = 'Перечисление доп. страховых взносов сотрудников'"),
		"СтраховыеВзносы",
		НСтр("ru = 'Доп. взносы сотрудников'")); // Заголовок выбора
		
	Если Настройка <> Неопределено Тогда
		Вариант = Настройка.Варианты.Добавить();
		Вариант.Условие       = "";
		Вариант.Представление = НСтр("ru = 'Не перечисляются доп. взносы сотрудников'");
		Вариант.ТекстВыбора   = НСтр("ru = 'не перечисляются'");
		
		Вариант = Настройка.Варианты.Добавить();
		Вариант.Условие       = УсловияПримененияТребованийЗаконодательства.УсловиеСтраховыеВзносыСотрудников();
		Вариант.Представление = НСтр("ru = 'Перечисляются доп. взносы сотрудников'");
		Вариант.ТекстВыбора   = НСтр("ru = 'перечисляются'");
	КонецЕсли;
	
	// Алкоголь
	УсловияАлкоголь = Новый Массив;
	УсловияАлкоголь.Добавить(УсловияПримененияТребованийЗаконодательства.УсловиеРозничнаяПродажаАлкоголя());
	УсловияАлкоголь.Добавить(УсловияПримененияТребованийЗаконодательства.УсловиеРозничнаяПродажаПива());
	УсловияАлкоголь.Добавить(УсловияПримененияТребованийЗаконодательства.УсловиеОптоваяТорговляАлкоголем());
	УсловияАлкоголь.Добавить(УсловияПримененияТребованийЗаконодательства.УсловиеПроизводствоАлгоколя());
	УсловияАлкоголь.Добавить(УсловияПримененияТребованийЗаконодательства.УсловиеПеревозкаАлкоголя());
	
	Для Каждого УсловиеАлкоголь Из УсловияАлкоголь Цикл
		
		Представление = "" + УсловияПримененияТребованийЗаконодательства.ПредставлениеУсловия(УсловиеАлкоголь);
		
		Настройка = ДобавитьНастройку(Настройки,
			Представление,
			"ДекларированиеАлкогольнойПродукции",
			Представление,
			Истина,           // Выбирать в списке
			УсловиеАлкоголь); // Настройка
			
	КонецЦикла;
	
	Возврат Настройки;
	
КонецФункции

Функция ДобавитьНастройку(Настройки, Наименование, КодЗадачи, ЗаголовокВыбора, ВыбиратьВСписке = Ложь, Варианты = Неопределено)
	
	Задача = Справочники.ЗадачиБухгалтера.НайтиПоКоду(КодЗадачи);
	
	Если Задача.Пустая() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	НоваяСтрока = Настройки.Добавить();
	НоваяСтрока.Наименование       = Наименование;
	НоваяСтрока.Задача             = Задача;
	НоваяСтрока.ЗаголовокВыбора    = ЗаголовокВыбора;
	НоваяСтрока.ВыбиратьВСписке    = ВыбиратьВСписке;
	
	Если Варианты = Неопределено Тогда
		НоваяСтрока.Варианты = РегистрыСведений.НалогиОтчеты.НовыйВариантыДетальнойНастройки();
		НоваяСтрока.Варианты.Колонки.Добавить("Условие", Новый ОписаниеТипов("Строка"));
	Иначе
		НоваяСтрока.Варианты = Варианты;
	КонецЕсли;
	
	Возврат НоваяСтрока;
	
КонецФункции

Функция УсловияИзНастроек(Организация) Экспорт
	
	ПроверенныеУсловия = Новый Соответствие;
	
	// Проверим, выполняются ли варианты по умолчанию.
	// Такие варианты выполняются, если пользователь не выбрал какой-либо вытесняющий вариант.
	ВариантыПоУмолчанию = Новый ТаблицаЗначений;
	ВариантыПоУмолчанию.Колонки.Добавить("Основной",    Новый ОписаниеТипов("Строка"));
	ВариантыПоУмолчанию.Колонки.Добавить("Вытесняющий", Новый ОписаниеТипов("Строка"));
	ВариантыПоУмолчанию.Индексы.Добавить("Вытесняющий");
	
	Для Каждого НаборВариантов Из НастройкиПримененияТребований() Цикл
		
		СпособОписанияВариантов = ТипЗнч(НаборВариантов.Варианты);
		Если СпособОписанияВариантов <> Тип("ТаблицаЗначений")  Тогда
			// Значений по умолчанию нет, вытеснять нечего
			Продолжить;
		КонецЕсли;
			
		КоличествоВариантов = НаборВариантов.Варианты.Количество();
		
		Если КоличествоВариантов = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ВариантПоУмолчанию = НаборВариантов.Варианты[0].Условие;
		
		Если Не ЗначениеЗаполнено(ВариантПоУмолчанию) Тогда
			// Этот вариант для нас бесполезен - вытеснять нечего
			Продолжить;
		КонецЕсли;
		
		ПроверенныеУсловия.Вставить(ВариантПоУмолчанию, Истина);
		
		Для Индекс = 1 По НаборВариантов.Варианты.Количество()-1 Цикл // Исключаем вариант по умолчанию
			
			НоваяСтрока = ВариантыПоУмолчанию.Добавить();
			НоваяСтрока.Основной    = ВариантПоУмолчанию;
			НоваяСтрока.Вытесняющий = НаборВариантов.Варианты[Индекс].Условие;
			
			ПроверенныеУсловия.Вставить(НоваяСтрока.Вытесняющий, Ложь);
			
		КонецЦикла;
		
	КонецЦикла;
	
	// Что выбрал пользователь в настройках списка?
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация",         Организация);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Настройки.Условие
	|ИЗ
	|	РегистрСведений.ВариантыПримененияТребованийЗаконодательства КАК Настройки
	|ГДЕ
	|	Настройки.Организация = &Организация";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		// Выбранное условие "включим"
		ПроверенныеУсловия.Вставить(Выборка.Условие, Истина);
		
		// Условия, вытесненные выбранным, "выключим"
		Отбор = Новый Структура;
		Отбор.Вставить("Вытесняющий", Выборка.Условие);
		Для Каждого Вытеснение Из ВариантыПоУмолчанию.НайтиСтроки(Отбор) Цикл
			ПроверенныеУсловия.Вставить(Вытеснение.Основной, Ложь);
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ПроверенныеУсловия;
	
КонецФункции

// Содержит перечень настроек, которые ранее хранились в этом регистре,
// но затем были перемещены в другие хранилища.
// 
// Возвращаемое значение:
//  ФиксированныйМассив из Строка- перечень настроек, см. общий модуль УсловияПримененияТребованийЗаконодательства
//
Функция УсловияПроверяемыеПоДругимНастройкам() Экспорт
	
	УсловияПроверяемыеПоДругимНастройкам = Новый Массив;
	
	// см. РегистрСведений.УчетнаяПолитика.Ресурсы.ВариантБухгалтерскойОтчетности
	УсловияПроверяемыеПоДругимНастройкам.Добавить(УсловияПримененияТребованийЗаконодательства.УсловиеБухгалтерскаяОтчетностьМалыеПредприятия());
	УсловияПроверяемыеПоДругимНастройкам.Добавить(УсловияПримененияТребованийЗаконодательства.УсловиеБухгалтерскаяОтчетностьНекоммерческиеОрганизации());
	УсловияПроверяемыеПоДругимНастройкам.Добавить(УсловияПримененияТребованийЗаконодательства.УсловиеБухгалтерскаяОтчетностьОбщаяФорма());
	УсловияПроверяемыеПоДругимНастройкам.Добавить(УсловияПримененияТребованийЗаконодательства.УсловиеБухгалтерскаяОтчетностьСоциальноОриентированные());
	
	// см. РегистрСведений.НастройкиУчетаНалогаНаПрибыль.Ресурсы.ПорядокУплатыАвансов
	УсловияПроверяемыеПоДругимНастройкам.Добавить(УсловияПримененияТребованийЗаконодательства.УсловиеНалогНаПрибыльАвансыЕжеквартально());
	УсловияПроверяемыеПоДругимНастройкам.Добавить(УсловияПримененияТребованийЗаконодательства.УсловиеНалогНаПрибыльАвансыЕжемесячно());
	УсловияПроверяемыеПоДругимНастройкам.Добавить(УсловияПримененияТребованийЗаконодательства.УсловиеНалогНаПрибыльАвансыПоФактическойПрибыли());
	
	Возврат Новый ФиксированныйМассив(УсловияПроверяемыеПоДругимНастройкам);
	
КонецФункции

#Область ОбработчикиОбновления

Процедура ЗаполнитьУсловияПримененияТребованийЗаконодательстваСтроковымиЗначениями() Экспорт
	
	ИменаЗначенийПеречисления = Новый Соответствие;
	МетаданныеЗначенийПеречисления = Метаданные.Перечисления.УдалитьУсловияПримененияТребованийЗаконодательства.ЗначенияПеречисления;
	
	Для Индекс = 0 По МетаданныеЗначенийПеречисления.Количество() - 1 Цикл
		ИменаЗначенийПеречисления.Вставить(
			Перечисления.УдалитьУсловияПримененияТребованийЗаконодательства[Индекс],
			МетаданныеЗначенийПеречисления[Индекс].Имя);
	КонецЦикла;
	
	ЕстьИзменения = Ложь;
	НаборЗаписей = РегистрыСведений.ВариантыПримененияТребованийЗаконодательства.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();
	Для Каждого Запись Из НаборЗаписей Цикл
		Если ЗначениеЗаполнено(Запись.Условие) Тогда
			Продолжить;
		КонецЕсли;
		Запись.Условие = ИменаЗначенийПеречисления[Запись.УдалитьУсловие];
		ЕстьИзменения = Истина;
	КонецЦикла;
	
	Если ЕстьИзменения Тогда
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(НаборЗаписей);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#КонецЕсли
